{"word2id": {"<START>": 0, "<END>": 1, "the": 2, "Hong": 3, "Kong": 4, "and": 5, "to": 6, "Limited": 7, "in": 8, "Securities": 9, "of": 10, "Road": 11, "Mr.": 12, "on": 13, "Public": 14, "Offer": 15, "International": 16, "or": 17, "PRC": 18, "1": 19, "Shares": 20, "The": 21, "under": 22, "Company": 23, "Agreement": 24, "Offering": 25, "Room": 26, "Capital": 27, "China": 28, "No.": 29, "for": 30, "Central": 31, "District": 32, "not": 33, "Tower": 34, "Joint": 35, "Global": 36, "any": 37, "conditions": 38, "Building": 39, "this": 40, "is": 41, "as": 42, "by": 43, "out": 44, "regulated": 45, "corporation": 46, "Underwriters": 47, "our": 48, "Flat": 49, "Block": 50, "(dealing": 51, "Ms.": 52, "be": 53, "licensed": 54, "Unit": 55, "subject": 56, "terms": 57, "securities)": 58, "(Hong": 59, "other": 60, "&": 61, "carry": 62, "Kong)": 63, "activities": 64, "SFO": 65, "(advising": 66, "Application": 67, "are": 68, "Street": 69, "Sole": 70, "Agreement,": 71, "been": 72, ".": 73, "type": 74, "prospectus": 75, "having": 76, "A": 77, "set": 78, "Listing": 79, "agreed": 80, "Province": 81, "4": 82, "As": 83, "Queen's": 84, "6": 85, "Centre": 86, "which": 87, "with": 88, "New": 89, "District,": 90, "Lead": 91, "issued": 92, "2": 93, "Committee": 94, "subscribe": 95, "a": 96, "Shanghai": 97, "behalf": 98, "Road,": 99, "Floor,": 100, "Managers": 101, "listing": 102, "procure": 103, "permission": 104, "Garden": 105, "Beijing": 106, "have": 107, "Connaught": 108, "Forms": 109, "UNDERWRITERS": 110, "subscription": 111, "AND": 112, "at": 113, "City": 114, "Pursuant": 115, "being": 116, "of,": 117, "conditional": 118, "deal": 119, "ARRANGEMENTS": 120, "granting": 121, "subscribers": 122, "EXPENSES": 123, "initially": 124, "(for": 125, "One": 126, "Floor": 127, "in,": 128, "corporate": 129, "finance)": 130, "Grand": 131, "(Chairman)": 132, "Place": 133, "certain": 134, "Cayman": 135, "Bookrunners": 136, "SFO)": 137, "House": 138, "Sponsor": 139, "Subject": 140, "Wan": 141, "8": 142, "Kowloon": 143, "Legal": 144, "East": 145, "Type": 146, "prospectus,": 147, "offered": 148, "Agreement.": 149, "Asia": 150, "Islands": 151, "law:": 152, "offering": 153, "3": 154, "(HK)": 155, "will": 156, "issue": 157, "taken": 158, "public": 159, "Exchange": 160, "Singapore": 161, "up": 162, "mentioned": 163, "Territories": 164, "pursuant": 165, "1,": 166, "Price": 167, "KONG": 168, "Li": 169, "HONG": 170, "9": 171, "Central,": 172, "West": 173, "A,": 174, "Square": 175, "fully": 176, "underwritten": 177, "for,": 178, "Financial": 179, "Coordinators": 180, "Law": 181, "Bank": 182, "(A": 183, "becoming": 184, "Underwriters)": 185, "B,": 186, "their": 187, "but": 188, "securities),": 189, "law": 190, "Lane": 191, "unconditional": 192, "upon": 193, "Wing": 194, "themselves": 195, "Voeux": 196, "Des": 197, "to,": 198, "(including": 199, "Dr.": 200, "Forms.": 201, "(a)": 202, "Plaza": 203, "2,": 204, "among": 205, "Avenue": 206, "(in": 207, "Chaoyang": 208, "United": 209, "respective": 210, "Wanchai": 211, "activity": 212, "Tai": 213, "may": 214, "Over-allotment": 215, "Beijing,": 216, "North": 217, "18": 218, "Bay": 219, "Guangdong": 220, "On": 221, "prior": 222, "Box": 223, "Stock": 224, "Finance": 225, "Chan": 226, "Wai": 227, "has": 228, "accordance": 229, "its": 230, "Group": 231, "change": 232, "shall": 233, "Chinese": 234, "applicable": 235, "into": 236, "notice": 237, "severally": 238, "5": 239, "Chun": 240, "proportions": 241, "Haitong": 242, "(i)": 243, "Lee": 244, "Center": 245, "Gloucester": 246, "Corporation": 247, "a.m.": 248, "Morgan": 249, "between": 250, "Compliance": 251, "approval": 252, "signed": 253, "Wong": 254, "Harbour": 255, "advisers": 256, "Man": 257, "South": 258, "Wang": 259, "3,": 260, "Option": 261, "LLP": 262, "committee": 263, "Co.,": 264, "Offering.": 265, "Town": 266, "Pacific": 267, "Level": 268, "Grounds": 269, "Markets": 270, "Chen": 271, "business": 272, "8:00": 273, "Zhejiang": 274, "ABCI": 275, "Placing": 276, "Ho": 277, "Chi": 278, "Corporate": 279, ")": 280, "Accountants": 281, "Coordinator": 282, "such": 283, "termination": 284, "Shenzhen": 285, "Suite": 286, "there": 287, "(asset": 288, "Po": 289, "Leung": 290, "Certified": 291, "Cheung": 292, "management)": 293, "relation": 294, "expected": 295, "terminated": 296, "defined": 297, "Services": 298, "itself": 299, "exercise": 300, "Province,": 301, "Drive": 302, "If,": 303, "88": 304, "reason,": 305, "adviser": 306, "Court": 307, "connection": 308, "now": 309, "Holdings": 310, "Yuan": 311, "CMB": 312, "Kwok": 313, "described": 314, "Singaporean": 315, "Registered": 316, "place": 317, "Industry": 318, "time": 319, "Manager": 320, "we": 321, "Liu": 322, "(a": 323, "(": 324, "lapse.": 325, "Ng": 326, "Tak": 327, "Jalan": 328, "Shares,": 329, "183": 330, "Shing": 331, "Ming": 332, "Share": 333, "Guotai": 334, "each": 335, "basis": 336, "Office": 337, "Zhang": 338, "Bookrunner": 339, "C,": 340, "Remuneration": 341, "proceed": 342, "Co.": 343, "Malaysia": 344, "Junan": 345, "case": 346, "Sun": 347, "Yu": 348, "Price.": 349, "Queensway": 350, "terms.": 351, "Jiangsu": 352, "consultant": 353, "(Asia)": 354, "only)": 355, "Street,": 356, "City,": 357, "First": 358, "Fung": 359, "permitted": 360, "Hung": 361, "15": 362, "jointly": 363, "Representatives": 364, "Cricket": 365, "Siu": 366, "ICBC": 367, "Reporting": 368, "that": 369, "absolute": 370, "terminate": 371, "Sha": 372, "Industrial": 373, "Shanghai,": 374, "P.O.": 375, "obligations": 376, "33": 377, "CCB": 378, "99": 379, "Underwriters.": 380, "Haidian": 381, "representatives": 382, "comprises": 383, "\"Structure": 384, "Partners": 385, "published": 386, "case,": 387, "Yi": 388, "Causeway": 389, "if": 390, "Audit": 391, "BOCOM": 392, "conditions,": 393, "reallocation": 394, "Authorised": 395, "Pudong": 396, "7": 397, "This": 398, "subject,": 399, "Chung": 400, "Receiving": 401, "Principal": 402, "2681": 403, "Company,": 404, "solely": 405, "Branch": 406, "Firm": 407, "B": 408, "Chai": 409, "(subject": 410, "Hutchins": 411, "effect": 412, "immediate": 413, "terminated.": 414, "basis.": 415, "well": 416, "Head": 417, "Citigroup": 418, "Zhongtai": 419, "Stanley": 420, "KY1-1111": 421, "CLSA": 422, "Yuen": 423, "11": 424, "Two": 425, "PUBLIC": 426, "10": 427, "King": 428, "OFFER": 429, "H": 430, "(b)": 431, "Offering\"": 432, "Commercial": 433, "D,": 434, "Directors": 435, "J.P.": 436, "Auditor": 437, "Ping": 438, "Kwan": 439, "Community": 440, "offer": 441, "Tower,": 442, "Independent": 443, "Brokerage": 444, "section": 445, "Phase": 446, "additional": 447, "things,": 448, "licenced": 449, "28": 450, "Fortune": 451, "Yan": 452, "Ka": 453, "was": 454, "secretary": 455, "entered": 456, "Guangzhou": 457, "Park": 458, "futures": 459, "Management": 460, "States": 461, "Yin": 462, "SFC": 463, "PO": 464, "Lam": 465, "I": 466, "Austin": 467, "Offices": 468, "Yang": 469, "headed": 470, "come": 471, "Lai": 472, "us": 473, "Wu": 474, "Sullivan": 475, "Termination": 476, "Shan": 477, "4,": 478, "member": 479, "office": 480, "12": 481, "Mei": 482, "Merchants": 483, "Chiu": 484, "Frost": 485, "Kin": 486, "carrying": 487, "forth": 488, "prospective": 489, "others,": 490, "purpose": 491, "Shoulders": 492, "Tong": 493, "(International)": 494, "22/F,": 495, "(including,": 496, "laws": 497, "Lin": 498, "Hoi": 499, "Wanchai,": 500, "Point": 501, "CMBC": 502, "Property": 503, "Jardine": 504, "(ii)": 505, "severally,": 506, "Hennessy": 507, "laws:": 508, "Chartered": 509, "Fai": 510, "(Asia": 511, "Pacific)": 512, "sole": 513, "Kowloon,": 514, "Tan": 515, "Cheng": 516, "Nanshan": 517, "Area": 518, "BOCI": 519, "event": 520, "Ma": 521, "Board": 522, "Landmark": 523, "Shun": 524, "\"": 525, "agreeing": 526, "Win": 527, "Yee": 528, "Advisers": 529, "Sheung": 530, "Sponsors": 531, "Kit": 532, "events": 533, "development": 534, "relating": 535, "Alpha": 536, "11/F,": 537, "Yue": 538, "Zhong": 539, "herein": 540, "subsequently": 541, "Auditors": 542, "Hang": 543, "Wei": 544, "Commerce": 545, "Futian": 546, "Fujian": 547, "Apartment": 548, "Xu": 549, "Headquarters": 550, "7,": 551, "Tin": 552, "Peak": 553, "29": 554, "Everbright": 555, "Consultant": 556, "16": 557, "Date:": 558, "acts": 559, "reporting": 560, "Xuhui": 561, "Hangzhou": 562, "Nomination": 563, "Elstone": 564, "Shui": 565, "County": 566, "writing": 567, "without": 568, "SPDB": 569, "Sponsor,": 570, "89": 571, "Fu": 572, "Mansion": 573, "Village": 574, "international": 575, "accountants": 576, "contracts)": 577, "Wah": 578, "9,": 579, "Taikoo": 580, "Lego": 581, "Main": 582, "Villa": 583, "effect:": 584, "involving": 585, "Dong": 586, "principal": 587, "Cayman,": 588, "Tian": 589, "Tung": 590, "Shandong": 591, "contained": 592, "time)": 593, "19": 594, "Long": 595, "Sai": 596, "Institute": 597, "Yeung": 598, "Futu": 599, "jointly,": 600, "Underwriters),": 601, "Offering).": 602, "Xicheng": 603, "conduct": 604, "DBS": 605, "Ching": 606, "LI": 607, "Shanxi": 608, "Huang": 609, "trading": 610, "Offering,": 611, "Island": 612, "Innovax": 613, "Resources": 614, "Sunlight": 615, "248": 616, "(on": 617, "18/F,": 618, "Tsuen": 619, "Ling": 620, "document": 621, "occur": 622, "189": 623, "Chater": 624, "Kong,": 625, "WANG": 626, "Investment": 627, "following": 628, "material": 629, "Date": 630, "Zone": 631, "Business": 632, "Ltd.": 633, "contracts),": 634, "Kok": 635, "Conyers": 636, "Address": 637, "Millennium": 638, "Tonghai": 639, "Prospectus": 640, "Jingtian": 641, "Kai": 642, "Kwun": 643, "Admiralty": 644, "Goldman": 645, "Sachs": 646, "26": 647, "Kam": 648, "information": 649, "Cinda": 650, "comes": 651, "Option)": 652, "Gongcheng": 653, "Chambers": 654, "Secretaries": 655, "Hopewell": 656, "L.L.C.": 657, "Centre,": 658, "engage": 659, "Rooms": 660, "Tsui": 661, "E,": 662, "301,": 663, "Lippo": 664, "Sinomax": 665, "Kingdom": 666, "Lau": 667, "Huatai": 668, "12/F,": 669, "CPA": 670, "Hui": 671, "Xin": 672, "Lim": 673, "Lei": 674, "Champion": 675, "Tsim": 676, "23": 677, "6,": 678, "U.S.": 679, "Tseung": 680, "10/F,": 681, "Shenzhen,": 682, "Adviser": 683, "Name": 684, "Units": 685, "Square,": 686, "Liang": 687, "reallocation)": 688, "(Joint": 689, "5/F,": 690, "188": 691, "F,": 692, "Kwong": 693, "Jia": 694, "Prince's": 695, "Nationality": 696, "Hongyuan": 697, "Coordinator,": 698, "Lok": 699, "Cosco": 700, "Town,": 701, "from": 702, "and/or": 703, "before": 704, "granted": 705, "executed,": 706, "on,": 707, "Woo": 708, "601,": 709, "Harcourt": 710, "Shenwan": 711, "Low": 712, "181": 713, "Jin": 714, "28/F,": 715, "Yau": 716, "Zhou": 717, "Hill": 718, "Coordinators,": 719, "(H.K.)": 720, "Hebei": 721, "Essence": 722, "Price),": 723, "force": 724, "77": 725, "Hysan": 726, "Advisory": 727, "Dill": 728, "Pearman": 729, "Shi": 730, "500": 731, "16/F,": 732, "Limited,": 733, "bank": 734, "19/F,": 735, "all": 736, "(the": 737, "affecting": 738, "Livermore": 739, "Lung": 740, "Heights": 741, "12/F": 742, "Suites": 743, "Aristo": 744, "Young": 745, "68": 746, "Tang": 747, "27/F,": 748, "An": 749, "alphabetical": 750, "Xiu": 751, "Asset": 752, "termination.": 753, "new": 754, "limitation,": 755, "Underwriters,": 756, "develop,": 757, "Relevant": 758, "9/F,": 759, "Middle": 760, "Jianguo": 761, "45/F,": 762, "Co-Lead": 763, "Fan": 764, "valuer": 765, "50": 766, "Accountant": 767, "Terrace": 768, "View": 769, "Avenue,": 770, "Alliance": 771, "(as": 772, "71": 773, "Orient": 774, "Galaxy": 775, "Hua": 776, "O": 777, "20": 778, "Ye": 779, "Keung": 780, "ZHANG": 781, "(Beijing)": 782, "Development": 783, "Advisors": 784, "Merrill": 785, "Lynch": 786, "In": 787, "failing": 788, "David": 789, "Yuk": 790, "5,": 791, "Nanjing": 792, "Deloitte": 793, "Quarry": 794, "King's": 795, "Tam": 796, "LIU": 797, "Lawyers": 798, "Hangzhou,": 799, "Ernst": 800, "Ying": 801, "financial": 802, "statement": 803, "relevant": 804, "amongst": 805, "II": 806, "25": 807, "ChaoShang": 808, "Internal": 809, "Taman": 810, "Touche": 811, "Non-executive": 812, "3/F,": 813, "7/F,": 814, "Jing": 815, "Century": 816, "8,": 817, "Ting": 818, "Chau": 819, "(HKICPA)": 820, "101,": 821, "AMTD": 822, "111": 823, "occurs,": 824, "options": 825, "limited": 826, "UBS": 827, "Authorized": 828, "Lun": 829, "accountant": 830, "PricewaterhouseCoopers": 831, "Wan,": 832, "Jiang": 833, "4th": 834, "Hon": 835, "Southwest": 836, "Chu": 837, "Sheng": 838, "Tianhe": 839, "401,": 840, "22/F": 841, "202,": 842, "Zhu": 843, "Yip": 844, "Macau": 845, "Garden,": 846, "Place,": 847, "GLAM": 848, "THE": 849, "way": 850, "Date.": 851, "(whether": 852, "entitled": 853, "Offer,": 854, "Underwriter": 855, "control": 856, "Executive": 857, "54,": 858, "Inc.,": 859, "39": 860, "Offering)": 861, "Kuala": 862, "40th": 863, "15/F,": 864, "11th": 865, "Residence": 866, "application": 867, "agreed,": 868, "Class": 869, "develops,": 870, "exists": 871, "local,": 872, "to:": 873, "exist": 874, "Building,": 875, "Republic": 876, "Tax": 877, "C": 878, "CHAN": 879, "6/F,": 880, "Lu": 881, "George": 882, "(Chairperson)": 883, "Hai": 884, "CRIC": 885, "Sichuan": 886, "Kingsway": 887, "Bookrunners,": 888, "40/F,": 889, "Lumpur": 890, "Gate": 891, "Chang": 892, "20/F": 893, "Credit": 894, "they": 895, "thereto": 896, "occur,": 897, "Tohmatsu": 898, "Valuer": 899, "21": 900, "San": 901, "No.1": 902, "House,": 903, "Territories,": 904, "Yunjin": 905, "Chairman": 906, "Ocean": 907, "20/F,": 908, "128": 909, "Three": 910, "1st": 911, "Tsui,": 912, "Suisse": 913, "exchange": 914, "giving": 915, "thereof": 916, "it": 917, "Shares.": 918, "be,": 919, "national": 920, "authority": 921, "AG": 922, "Rules)": 923, "Seng": 924, "Director": 925, "Advisor": 926, "CHEN": 927, "38": 928, "Guo": 929, "11/F": 930, "Zhao": 931, "10,": 932, "Consultancy": 933, "Tao": 934, "Appraisal": 935, "when": 936, "existing": 937, "interpretation": 938, "court": 939, "–": 940, "Sze": 941, "ACS)": 942, "8/F,": 943, "27": 944, "Residential": 945, "16/F": 946, "31/F,": 947, "Tsang": 948, "Sing": 949, "23/F,": 950, "Co-lead": 951, "Tim": 952, "Wharf": 953, "London": 954, "Jinjiang": 955, "members": 956, "Islands,": 957, "revoked": 958, "discretion,": 959, "discretion": 960, "national,": 961, "competent": 962, "executed": 963, "Sang": 964, "(Cayman)": 965, "29/F,": 966, "Link": 967, "Chee": 968, "Fong": 969, "HUANG": 970, "Chinachem": 971, "Nanjing,": 972, "1018,": 973, "YANG": 974, "JP": 975, "Pui": 976, "Guosen": 977, "Taiwan": 978, "Zheng": 979, "302,": 980, "Hongkong": 981, "American": 982, "501,": 983, "an": 984, "prospectus.": 985, "nature": 986, "Forms,": 987, "war,": 988, "series": 989, "30": 990, "Gardens": 991, "Section": 992, "13": 993, "Yiu": 994, "Tin,": 995, "Hing": 996, "Chengdu": 997, "Chengdu,": 998, "Jun": 999, "7/F": 1000, "H,": 1001, "Solicitors,": 1002, "Representative": 1003, "Times": 1004, "Peng": 1005, "Realord": 1006, "Xihu": 1007, "Jianguomenwai": 1008, "602,": 1009, "CITIC": 1010, "Feng": 1011, "order)": 1012, "World": 1013, "PRC,": 1014, "than": 1015, "2019.": 1016, "regional": 1017, "revoked;": 1018, "opinion": 1019, "thereto.": 1020, "Prospectus,": 1021, "Jian": 1022, "Golden": 1023, "Chong": 1024, "People's": 1025, "10/F": 1026, "company": 1027, "Bukit": 1028, "Min": 1029, "17": 1030, "6/F": 1031, "9/F": 1032, "80": 1033, "Nan": 1034, "Alexandra": 1035, "Bay,": 1036, "activities)": 1037, "Mak": 1038, "Great": 1039, "known": 1040, "Xiamen": 1041, "Senior": 1042, "Edinburgh": 1043, "Zhongshan": 1044, "Minhang": 1045, "33/F,": 1046, "part": 1047, "Renaissance": 1048, "BNP": 1049, "Paribas": 1050, "European": 1051, "market": 1052, "CCASS": 1053, "including": 1054, "documents": 1055, "majeure": 1056, "adjustment)": 1057, "withdrawn": 1058, "regulation": 1059, "Hu": 1060, "Ding": 1061, "Shatin": 1062, "43/F,": 1063, "Fidelity": 1064, "WU": 1065, "Yong": 1066, "2nd": 1067, "Securities)": 1068, "Cheong": 1069, "Hao": 1070, "Fang": 1071, "Sham": 1072, "Matheson": 1073, "901,": 1074, "201,": 1075, "Maples": 1076, "Patrick": 1077, "Agricultural": 1078, "Neich": 1079, "advisors": 1080, "Soochow": 1081, "Michael": 1082, "Gao": 1083, "Malaysian": 1084, "Banking": 1085, "-": 1086, "We": 1087, "given": 1088, "2020.": 1089, "declaration": 1090, "untrue,": 1091, "To": 1092, "Crosby": 1093, "University": 1094, "PARTIES": 1095, "INVOLVED": 1096, "IN": 1097, "Pan": 1098, "Jones": 1099, "Red": 1100, "Jiayuan": 1101, "Eagle": 1102, "association": 1103, "KY1-1104": 1104, "Licensed": 1105, "Appleby": 1106, "19/F.,": 1107, "Lo": 1108, "26/F,": 1109, "Co-Managers": 1110, "Taipei": 1111, "form": 1112, "Mallesons": 1113, "respect": 1114, "Foundation": 1115, "foreign": 1116, "If": 1117, "economic": 1118, "commencement": 1119, "Union": 1120, "Option),": 1121, "written": 1122, "addition,": 1123, "government,": 1124, "Underwriters)),": 1125, "States,": 1126, "writing)": 1127, "Chuen": 1128, "Maxa": 1129, "secretaries": 1130, "7th": 1131, "19th": 1132, "Tong,": 1133, "One,": 1134, "Huayuan": 1135, "12th": 1136, "William": 1137, "Yat": 1138, "Sorrento": 1139, "Xi": 1140, "402,": 1141, "Changchun": 1142, "Fengtai": 1143, "He": 1144, "Ugland": 1145, "75": 1146, "Standard": 1147, "21/F,": 1148, "Insights": 1149, "19,": 1150, "Lockhart": 1151, "do": 1152, "Wood": 1153, "13/F,": 1154, "Chuenman": 1155, "misleading": 1156, "subscriptions": 1157, "outbreak": 1158, "force:": 1159, "JOINT": 1160, "19/F": 1161, "148": 1162, "11,": 1163, "Suzhou": 1164, "(Certified": 1165, "Parkview": 1166, "Lang": 1167, "LaSalle": 1168, "Tat": 1169, "31": 1170, "G,": 1171, "So": 1172, "Tsz": 1173, "Han": 1174, "Wealth": 1175, "Dongcheng": 1176, "Canary": 1177, "E14": 1178, "1101,": 1179, "15/F": 1180, "Astrum": 1181, "Center,": 1182, "Guangdong,": 1183, "Sum": 1184, "Ever-Long": 1185, "For": 1186, "(or": 1187, "right": 1188, "subscribe,": 1189, "Canada": 1190, "Baker": 1191, "Che": 1192, "25/F,": 1193, "(ACIS,": 1194, "61": 1195, "YU": 1196, "Lui": 1197, "388": 1198, "2/F,": 1199, "GF": 1200, "14": 1201, "Association": 1202, "702,": 1203, "Huangpu": 1204, "22nd": 1205, "Macquarie": 1206, "PRC*": 1207, "Two,": 1208, "America": 1209, "Au": 1210, "plc": 1211, "Kan": 1212, "NCI": 1213, "Xiao": 1214, "Dongxing": 1215, "12,": 1216, "Zhejiang,": 1217, "8/F": 1218, "does": 1219, "32": 1220, "288": 1221, "Seazen": 1222, "Land": 1223, "reasonable": 1224, "likely": 1225, "issued,": 1226, "Date,": 1227, "various": 1228, "include,": 1229, "prospectus;": 1230, "(collectively,": 1231, "shares": 1232, "Kau": 1233, "17th": 1234, "future": 1235, "GLOBAL": 1236, "145": 1237, "Castle": 1238, "Sau": 1239, "5th": 1240, "168–200": 1241, "Royal": 1242, "29th": 1243, "Economic": 1244, "Jilin": 1245, "502,": 1246, "Cheuk": 1247, "industry": 1248, "Point,": 1249, "(formerly": 1250, "Pak": 1251, "Heung": 1252, "Chai,": 1253, "27th": 1254, "18th": 1255, "Pok": 1256, "Ning": 1257, "SBI": 1258, "A12": 1259, "10th": 1260, "Raymond": 1261, "45": 1262, "Valuable": 1263, "Accountants)": 1264, "Chow": 1265, "Singapore,": 1266, "Mason": 1267, "made": 1268, "CEB": 1269, "13th": 1270, "BVI": 1271, "stock": 1272, "circumstance": 1273, "markets,": 1274, "events,": 1275, "Mazars": 1276, "WONG": 1277, "Hau": 1278, "22": 1279, "Yuan,": 1280, "Moore": 1281, "21st": 1282, "Jie": 1283, "Ltd": 1284, "Fo": 1285, "Changning": 1286, "168-200": 1287, "Siming": 1288, "Valley": 1289, "3/F": 1290, "Governance": 1291, "Entity": 1292, "Ngai": 1293, "Fort": 1294, "Bo": 1295, "*": 1296, "Bin": 1297, "801,": 1298, "Leong": 1299, "Area,": 1300, "Our": 1301, "18/F": 1302, "Grande": 1303, "LLC": 1304, "May": 1305, "prospectus)": 1306, "further": 1307, "Mr": 1308, "Futures": 1309, "Ipsos": 1310, "REIT": 1311, "Determination": 1312, "unconditional.": 1313, "Jurisdictions": 1314, "related": 1315, "ordinary": 1316, "Path": 1317, "Suet": 1318, "Courtyard": 1319, "Tuen": 1320, "Heng": 1321, "Wee": 1322, "ACIS,": 1323, "Yun": 1324, "13/F": 1325, "Choi": 1326, "Dato'": 1327, "MA": 1328, "Ruibang": 1329, "auditors": 1330, "103": 1331, "Paul": 1332, "100": 1333, "34/F,": 1334, "Trust": 1335, "13,": 1336, "20th": 1337, "45/F": 1338, "Interest": 1339, "Convention": 1340, "Shen": 1341, "50/F,": 1342, "KY1-1108": 1343, "Fook": 1344, "Braemar": 1345, "24/F,": 1346, "Shu": 1347, "CA": 1348, "17/F": 1349, "1/F,": 1350, "Banks": 1351, "Bel-Air": 1352, "VBG": 1353, "5/F": 1354, "Ring": 1355, "Hogan": 1356, "Lovells": 1357, "Estate": 1358, "James": 1359, "Jing'an": 1360, "Company's": 1361, "website": 1362, "16,": 1363, "refer": 1364, "OFFERING": 1365, "person": 1366, "Tree": 1367, "Time": 1368, "used": 1369, "calamity,": 1370, "crisis,": 1371, "apply": 1372, "result": 1373, "considered": 1374, "KPMG": 1375, "24": 1376, "Mun": 1377, "Secretary": 1378, "9th": 1379, "17/F,": 1380, "Celestial": 1381, "engaged": 1382, "Risk": 1383, "UOB": 1384, "3rd": 1385, "(chairman)": 1386, "Tianjin": 1387, "Kung": 1388, "CORPORATE": 1389, "1601,": 1390, "Chin": 1391, "Kang": 1392, "Luk": 1393, "4/F,": 1394, "auditor": 1395, "1706,": 1396, "Xian": 1397, "Weihai": 1398, "Hunan": 1399, "2/F": 1400, "Zhen": 1401, "Zone,": 1402, "26th": 1403, "8th": 1404, "28/F": 1405, "Kwai": 1406, "Kuen": 1407, "979": 1408, "Go": 1409, "Frontpage": 1410, "agree": 1411, "development,": 1412, "pricing": 1413, "otherwise,": 1414, "becoming,": 1415, "continuing": 1416, "emergency": 1417, "Documents": 1418, "financial,": 1419, "military,": 1420, "(orally": 1421, "if:": 1422, "was,": 1423, "Electric": 1424, "ACS,": 1425, "Yuzhou": 1426, "Anhui": 1427, "Kingdom)": 1428, "Selangor": 1429, "Shatin,": 1430, "31st": 1431, "Boon": 1432, "Shuk": 1433, "Martin": 1434, "Fuzhou": 1435, "37/F,": 1436, "Henan": 1437, "Song": 1438, "\"Directors": 1439, "Co": 1440, "John": 1441, "101": 1442, "Chuan": 1443, "E": 1444, "Lake": 1445, "Gulou": 1446, "Thomas": 1447, "Qingyang": 1448, "YEUNG": 1449, "16th": 1450, "Kee": 1451, "32/F": 1452, "Yunnan,": 1453, "Poon": 1454, "Anthony": 1455, "ZHU": 1456, "Way": 1457, "(HONG": 1458, "KONG)": 1459, "DL": 1460, "17,": 1461, "333": 1462, "Ningbo": 1463, "<URL>": 1464, "no": 1465, "Victory": 1466, "Dakin": 1467, "HTF": 1468, "Overseas": 1469, "October": 1470, "Zhujiang": 1471, "securities": 1472, "DIRECTORS": 1473, "54": 1474, "Chambers,": 1475, "Future": 1476, "Japan": 1477, "00": 1478, "AFG": 1479, "Capitalisation": 1480, "political,": 1481, "industrial,": 1482, "Offer.": 1483, "25,000,000": 1484, "permanent)": 1485, "right,": 1486, "Kingdom,": 1487, "Luohu": 1488, "Companies": 1489, "COSCO": 1490, "LEUNG": 1491, "Tilly": 1492, "Prof.": 1493, "Keong": 1494, "HKICPA": 1495, "Koo": 1496, "Selangor,": 1497, "27/F": 1498, "(Dealing": 1499, "227-228": 1500, "Administrators": 1501, "Church": 1502, "18,": 1503, "108": 1504, "Chui": 1505, "VMS": 1506, "Guangzhou,": 1507, "Taiyuan": 1508, "Conrad": 1509, "Cushman": 1510, "Wakefield": 1511, "Valuation": 1512, "Clifton": 1513, "NG": 1514, "Second": 1515, "1901,": 1516, "Walkers": 1517, "Kunming": 1518, "51": 1519, "Kay": 1520, "Hian": 1521, "Ki": 1522, "non-executive": 1523, "D": 1524, "83": 1525, "15th": 1526, "Panyu": 1527, "Tsing": 1528, "Changping": 1529, "West,": 1530, "1201,": 1531, "Foo": 1532, "Binjiang": 1533, "98": 1534, "25th": 1535, "executive": 1536, "14,": 1537, "Laoshan": 1538, "AIA": 1539, "Nomura": 1540, "CIS": 1541, "date": 1542, "December": 1543, "context": 1544, "(iii)": 1545, "formal": 1546, "Issue": 1547, "Scheme)": 1548, "strikes,": 1549, "fire,": 1550, "explosion,": 1551, "flooding,": 1552, "earthquake,": 1553, "civil": 1554, "commotion,": 1555, "applications,": 1556, "Jurisdiction": 1557, "adjustment": 1558, "limitation:": 1559, "opinion,": 1560, "8:": 1561, "become,": 1562, "Time:": 1563, "currency": 1564, "satisfied": 1565, "supplement": 1566, "thereto)": 1567, "matters,": 1568, "833": 1569, "102,": 1570, "G/F,": 1571, "41": 1572, "Jianye": 1573, "Shunyi": 1574, "1/F": 1575, "Accountant)": 1576, "Sidley": 1577, "TANG": 1578, "Green": 1579, "503,": 1580, "Westlands": 1581, "Court,": 1582, "28th": 1583, "Alley": 1584, "Happy": 1585, "GUO": 1586, "(Shenzhen)": 1587, "Ji": 1588, "Jinan": 1589, "199": 1590, "Management\"": 1591, "Repulse": 1592, "95": 1593, "Yeo": 1594, "Guizhou": 1595, "238": 1596, "Sin": 1597, "Merdeka": 1598, "309,": 1599, "178": 1600, "registered": 1601, "Dr": 1602, "Barrister-at-law": 1603, "Eng": 1604, "SFO))": 1605, "Wen": 1606, "48": 1607, "Xing": 1608, "Towers": 1609, "Crescent": 1610, "Assets": 1611, "La": 1612, "603,": 1613, "uSmart": 1614, "40": 1615, "Kun": 1616, "23/F": 1617, "officer": 1618, "Queensway,": 1619, "Bridge": 1620, "2002,": 1621, "37": 1622, "SHINEWING": 1623, "15,": 1624, "Yangpu": 1625, "Deutsche": 1626, "Fei": 1627, "Taizhou,": 1628, "(CPA)": 1629, "(Chairlady)": 1630, "order": 1631, "HeungKong": 1632, "Hom,": 1633, "East,": 1634, "Shareholders": 1635, "Investor": 1636, "occurrence": 1637, "Roc": 1638, "available": 1639, "regulations": 1640, "below": 1641, "final": 1642, "epidemic,": 1643, "pandemic,": 1644, "eruption,": 1645, "disorder,": 1646, "if,": 1647, "jurisdiction": 1648, "(each": 1649, "change,": 1650, "(or,": 1651, "waived),": 1652, "aggregate,": 1653, "applying": 1654, "1214A,": 1655, "ACS": 1656, "1010": 1657, "Huaihai": 1658, "Park,": 1659, "Frank": 1660, "Co-Manager": 1661, "Deacons": 1662, "Pedder": 1663, "Pte": 1664, "Nam": 1665, "Lan": 1666, "Johor": 1667, "Luo": 1668, "LIN": 1669, "Shiu": 1670, "Peter": 1671, "XU": 1672, "Lingxi": 1673, "Cangnan": 1674, "Shennan": 1675, "Registrar": 1676, "York": 1677, "HK": 1678, "Cao": 1679, "Underwriter(s)": 1680, "Sunfund": 1681, "Oasis": 1682, "Community,": 1683, "Tse": 1684, "Kei": 1685, "39/F,": 1686, "Gu": 1687, "Norton": 1688, "Fulbright": 1689, "Hospital": 1690, "Dai": 1691, "USA": 1692, "Changsha": 1693, "Ample": 1694, "Wo": 1695, "Qingdao,": 1696, "Block,": 1697, "engaging": 1698, "Chongqing,": 1699, "(Solicitors": 1700, "Shangcheng": 1701, "35/F": 1702, "BDO": 1703, "Village,": 1704, "Shao": 1705, "Yim": 1706, "Laguna": 1707, "Eric": 1708, "Men": 1709, "CHENG": 1710, "1350": 1711, "33,": 1712, "Ap": 1713, "Changzhou": 1714, "34": 1715, "statements": 1716, "Solicitors": 1717, "Technology": 1718, "701,": 1719, "Market": 1720, "property": 1721, "expect": 1722, "Shan,": 1723, "Fosun": 1724, "Hani": 1725, "Gang": 1726, "Sub-district": 1727, "Sky": 1728, "senior": 1729, "Qing": 1730, "Rich": 1731, "AG,": 1732, "Solomon": 1733, "prospects": 1734, "determined": 1735, "after": 1736, "Post-IPO": 1737, "sanctions,": 1738, "escalation": 1739, "that:": 1740, "June": 1741, "economic,": 1742, "credit": 1743, "September": 1744, "Incentive": 1745, "INTERNATIONAL": 1746, "intention": 1747, "majeure,": 1748, "applicants": 1749, "undertakings": 1750, "10,000,000": 1751, "(\"": 1752, "ICBCI": 1753, "Long,": 1754, "TAN": 1755, "(M)": 1756, "Yuanta": 1757, "Ko": 1758, "Jaya": 1759, "Dentons": 1760, "Admiralty,": 1761, "Ascot": 1762, "Squire": 1763, "Patton": 1764, "Boggs": 1765, "Bing": 1766, "24,": 1767, "Giraffe": 1768, "Insurance": 1769, "address": 1770, "Yew": 1771, "Ordinance": 1772, "Bookrunner,": 1773, "Keng": 1774, "O,": 1775, "55": 1776, "11/F.,": 1777, "Science": 1778, "Yitian": 1779, "23rd": 1780, "KY1-9008": 1781, "Vision": 1782, "Cherie": 1783, "Avenida": 1784, "Kerry": 1785, "ACIS)": 1786, "SPD": 1787, "52": 1788, "Kevin": 1789, "Members": 1790, "Xiaoqu": 1791, "Consulting": 1792, "Koh": 1793, "Huan": 1794, "Chew": 1795, "135": 1796, "Kelvin": 1797, "4/F": 1798, "24/F": 1799, "Calder": 1800, "Huajin": 1801, "Bluemount": 1802, "No": 1803, "British": 1804, "(Fellow": 1805, "Nanchang": 1806, "2511,": 1807, "5LB": 1808, "Heping": 1809, "Tiger": 1810, "Wenling": 1811, "Horizons": 1812, "SUN": 1813, "Door": 1814, "Yuanyin": 1815, "Drive,": 1816, "32/F,": 1817, "HO": 1818, "Directors,": 1819, "Yao": 1820, "Glory": 1821, "204,": 1822, "Wa": 1823, "associate": 1824, "ZHAO": 1825, "Sanctions": 1826, "30/F,": 1827, "Life": 1828, "Document": 1829, "Ground": 1830, "Other": 1831, "600": 1832, "188778": 1833, "Kim": 1834, "Teck": 1835, "Eddid": 1836, "Albert": 1837, "2020": 1838, "Joy": 1839, "Lu,": 1840, "joint": 1841, "adversely": 1842, "admitted": 1843, "money": 1844, "2019,": 1845, "Wednesday,": 1846, "Division": 1847, "lock-outs,": 1848, "hostilities": 1849, "war": 1850, "declared),": 1851, "event,": 1852, "which,": 1853, "incorrect": 1854, "become": 1855, "20,000,000": 1856, "inaccurate": 1857, "breach": 1858, "contain": 1859, "later": 1860, "\");": 1861, "participant": 1862, "1001,": 1863, "151": 1864, "1701,": 1865, "6B,": 1866, "Harbourfront": 1867, "Kennedy": 1868, "501": 1869, "43000": 1870, "Kajang": 1871, "Zeng": 1872, "Securities),": 1873, "Mao": 1874, "57/F,": 1875, "Wellington": 1876, "Wuhan": 1877, "33/F": 1878, "Tsun": 1879, "Gary": 1880, "Pte.": 1881, "Raffles": 1882, "GEM": 1883, "NY": 1884, "FCIS,": 1885, "Haishu": 1886, "38/F,": 1887, "Monkey": 1888, "Guan": 1889, "Supervisor": 1890, "Pei": 1891, "Zhonghua": 1892, "Part": 1893, "309": 1894, "Richard": 1895, "Luen": 1896, "35": 1897, "Jiading": 1898, "Wai,": 1899, "Terence": 1900, "2206–19": 1901, "14/F": 1902, "Koon": 1903, "555": 1904, "Guang": 1905, "RSM": 1906, "Water": 1907, "27/F.,": 1908, "Lodge": 1909, "9/F.,": 1910, "Fa": 1911, "Yung": 1912, "Technological": 1913, "Smith": 1914, "Grant": 1915, "Hastings": 1916, "29/F": 1917, "Yunhe": 1918, "6th": 1919, "Shin": 1920, "P.": 1921, "Xiang": 1922, "Soon": 1923, "Selling": 1924, "Langfang": 1925, "Prosperity": 1926, "de": 1927, "Mont": 1928, "Mid-Levels": 1929, "Villas": 1930, "HU": 1931, "Chuk": 1932, "Charles": 1933, "Kar": 1934, "Far": 1935, "should": 1936, "Oi": 1937, "Fat": 1938, "Robertsons": 1939, "All": 1940, "Lane,": 1941, "2020,": 1942, "responsibility": 1943, "types": 1944, "Ang": 1945, "consolidated": 1946, "Lewis": 1947, "Cai": 1948, "Victoria": 1949, "March": 1950, "2019": 1951, "INFORMATION": 1952, "Scheme": 1953, "arrangements": 1954, "resulting": 1955, "occurs": 1956, "notices,": 1957, "Monday,": 1958, "may,": 1959, "disease,": 1960, "Controlling": 1961, "BVI,": 1962, "system": 1963, "bond": 1964, "markets": 1965, "events:": 1966, "allotment": 1967, "regulation,": 1968, "''Relevant": 1969, "matter": 1970, "Price)": 1971, "amendment": 1972, "proceed.": 1973, "representations,": 1974, "LEAD": 1975, "MANAGERS": 1976, "Qi": 1977, "Tony": 1978, "TUS": 1979, "Hock": 1980, "LEE": 1981, "Jincheng": 1982, "Horizon": 1983, "Xincheng": 1984, "Management)": 1985, "Zundiao": 1986, "AllBright": 1987, "2705-6,": 1988, "35/F,": 1989, "Hefei": 1990, "Sir": 1991, "198": 1992, "46/F,": 1993, "Tan,": 1994, "302": 1995, "Qiang": 1996, "44": 1997, "Yick": 1998, "625": 1999, "FCS": 2000, "Jianhua": 2001, "Zinvest": 2002, "(黃冠豪)": 2003, "Wuchang": 2004, "Kingkey": 2005, "20,": 2006, "Hip": 2007, "Woon": 2008, "Marina": 2009, "2206-19": 2010, "Joseph": 2011, "Taiping": 2012, "168": 2013, "Broad": 2014, "Uk": 2015, "Jiong": 2016, "Yard": 2017, "da": 2018, "Wangjing": 2019, "Flower": 2020, "audit": 2021, "Williams": 2022, "Nga": 2023, "68/F,": 2024, "Third": 2025, "Greenland": 2026, "Tomorrow": 2027, "Kunshan": 2028, "LLC,": 2029, "Luoshan": 2030, "Henry": 2031, "Sri": 2032, "56": 2033, "Jianggan": 2034, "Hom": 2035, "203,": 2036, "Pulau": 2037, "Pinang": 2038, "Nos.": 2039, "Deng": 2040, "Kum": 2041, "23,": 2042, "Mount": 2043, "Jardine's": 2044, "Pu": 2045, "43/F": 2046, "Bradbury": 2047, "Infinitus": 2048, "(Licensed": 2049, "Betty": 2050, "Germany": 2051, "304,": 2052, "Yinzhou": 2053, "Sponsors,": 2054, "14/F,": 2055, "please": 2056, "2A": 2057, "Mansions": 2058, "55/F,": 2059, "Palazzo": 2060, "32,": 2061, "Rise": 2062, "CHEUNG": 2063, "ACIS": 2064, "Qiu": 2065, "Guoming": 2066, "1102,": 2067, "57th": 2068, "Kiu": 2069, "Harry": 2070, "nor": 2071, "Pavilion": 2072, "Shaanxi": 2073, "Dan": 2074, "Faith": 2075, "Rita": 2076, "Emperor": 2077, "Perkins": 2078, "Please": 2079, "Choy": 2080, "139": 2081, "Robinson": 2082, "th": 2083, "Zi": 2084, "February": 2085, "CGS-CIMB": 2086, "LU": 2087, "902,": 2088, "Wilson": 2089, "Campbells": 2090, "Fok": 2091, "Fuk": 2092, "Kornhill": 2093, "F": 2094, "November": 2095, "Blackwell": 2096, "thereof)": 2097, "enter": 2098, "Shares;": 2099, "Underwriters:": 2100, "50,000,000": 2101, "volcanic": 2102, ");": 2103, "awards": 2104, "Preferential": 2105, "expectation": 2106, "day": 2107, "representing": 2108, "12,500,000": 2109, "herein,": 2110, "Clearing": 2111, "participate": 2112, "Conditions": 2113, "Offering\")": 2114, "Nanli": 2115, "35th": 2116, "29,": 2117, "Tianjin,": 2118, "Shek": 2119, "Plutus": 2120, "Midtown": 2121, "Hei": 2122, "31/F.,": 2123, "Leng": 2124, "(黃康福)": 2125, "K.": 2126, "Ren": 2127, "Allbright": 2128, "Kwang": 2129, "Mewah": 2130, "California": 2131, "Yih": 2132, "27,": 2133, "HLB": 2134, "Hodgson": 2135, "Impey": 2136, "999": 2137, "Taylor": 2138, "Wessing": 2139, "Discovery": 2140, "398": 2141, "N.": 2142, "Bahru": 2143, "Gaoxin": 2144, "Battery": 2145, "Tianfu": 2146, "Control": 2147, "Li,": 2148, "Leighton": 2149, "No.6": 2150, "Sunshine": 2151, "Xuanwu": 2152, "Cun": 2153, "Wuhan,": 2154, "Hubei": 2155, "Old": 2156, "Mid-levels": 2157, "Guiyang,": 2158, "36/F,": 2159, "Jeffrey": 2160, "Shum": 2161, "Hoe": 2162, "Gong": 2163, "Po,": 2164, "ZHOU": 2165, "CFN": 2166, "High-tech": 2167, "Rose": 2168, "iResearch": 2169, "81": 2170, "Yuexiu": 2171, "Haizhu": 2172, "Le": 2173, "Emperio": 2174, "And": 2175, "Dongsanhuan": 2176, "Zhonglu": 2177, "Oriental": 2178, "Xue": 2179, "Downtown": 2180, "Yujing": 2181, "Andar": 2182, "Shenton": 2183, "SAR)": 2184, "province": 2185, "399": 2186, "No.1,": 2187, "Ling,": 2188, "Ogier": 2189, "802": 2190, "Bandar": 2191, "Cangzhou": 2192, "Yangguang": 2193, "Way,": 2194, "Ave": 2195, "Headquarter": 2196, "Ge": 2197, "26/F": 2198, "ICSA)": 2199, "Piu": 2200, "Vinco": 2201, "Jiangxi,": 2202, "Quasar": 2203, "Lookout": 2204, "Ballas": 2205, "Puji": 2206, "79": 2207, "158": 2208, "Nei": 2209, "Beverly": 2210, "2201,": 2211, "Coast": 2212, "Brilliant": 2213, "Australia": 2214, "Reservoir": 2215, "Notaries": 2216, "Putuo": 2217, "Qin": 2218, "Fujian,": 2219, "200232": 2220, "Koala": 2221, "(HKICS)": 2222, "St.": 2223, "YE": 2224, "Simon": 2225, "Daiwa": 2226, "Howse": 2227, "Xinhua": 2228, "Arch": 2229, "Titan": 2230, "Zongzheng": 2231, "Mingshan": 2232, "(鐘明山)": 2233, "Lantau": 2234, "Melaka": 2235, "Ha": 2236, "Zhongrong": 2237, "Vanke": 2238, "expressed": 2239, "22/F.,": 2240, "Xiaoping": 2241, "Sui": 2242, "Australian": 2243, "BLK": 2244, "Paragon": 2245, "Klang": 2246, "Mo": 2247, ",": 2248, "Kwa": 2249, "Jiangxi": 2250, "(何永深)": 2251, "36": 2252, "Bangkok": 2253, "OUE": 2254, "Beacon": 2255, "\"Directors,": 2256, "86": 2257, "(leveraged": 2258, "trading)": 2259, "Shandong,": 2260, "Qingdao": 2261, "K.Wah": 2262, "Investments": 2263, "annual": 2264, "403,": 2265, "De": 2266, "802,": 2267, "LIMITED": 2268, "Wuxi": 2269, "CCBI": 2270, "Duanzhou": 2271, "Zhaoqing": 2272, "Fruit": 2273, "LAU": 2274, "(Asset": 2275, "Haitao": 2276, "36–4201,": 2277, "Haixin": 2278, "Tianxi,": 2279, "ZHENG": 2280, "Da": 2281, "Managers,": 2282, "Thomson": 2283, "Donggang": 2284, "Founder": 2285, "46": 2286, "Silk": 2287, "31/F": 2288, "JunHe": 2289, "Tianning": 2290, "see": 2291, "JFZ": 2292, "26,": 2293, "affect": 2294, "(楊德泉)": 2295, "OF": 2296, "settlement": 2297, "ourselves": 2298, "January": 2299, "announcements,": 2300, "riots,": 2301, "God": 2302, "otherwise": 2303, "fiscal,": 2304, "regulatory,": 2305, "be:": 2306, "expression": 2307, "PLACING": 2308, "jurisdiction(s)": 2309, "around": 2310, "portions": 2311, "position": 2312, "allotted": 2313, "document,": 2314, "KGI": 2315, "Tongzhou": 2316, "1801,": 2317, "G": 2318, "Si": 2319, "53": 2320, "Yoho": 2321, "43": 2322, "50th": 2323, "Hunghom": 2324, "Wui": 2325, "14th": 2326, "CHU": 2327, "1916": 2328, "Qian": 2329, "173": 2330, "Clifford": 2331, "Chance": 2332, "40/F.,": 2333, "10240": 2334, "KY1-1002": 2335, "Consultants": 2336, "Lap": 2337, "T.": 2338, "Furong": 2339, "Hoong": 2340, "Piper": 2341, "Xiamen,": 2342, "Nanguan": 2343, "Broadwood": 2344, "Wuhou": 2345, "Du": 2346, "Ningbo,": 2347, "Fengsheng": 2348, "FU": 2349, "Lik": 2350, "Pang": 2351, "Loke": 2352, "44/F": 2353, "Air": 2354, "(Phase": 2355, "Shores": 2356, "Savills": 2357, "TONG": 2358, "8/F.,": 2359, "Edward": 2360, "Yiwu": 2361, "Boulevard": 2362, "attorneys-at-law": 2363, "Shau": 2364, "Bright": 2365, "Palm": 2366, "25/F": 2367, "Port": 2368, "Advocates": 2369, "(ACS,": 2370, "21/F": 2371, "Quan": 2372, "Seasons": 2373, "Professor": 2374, "1706": 2375, "22,": 2376, "Hou": 2377, "53rd": 2378, "College": 2379, "Yifan": 2380, "(Chairman": 2381, "Cui": 2382, "28,": 2383, "Ya": 2384, "202": 2385, "Renmin": 2386, "Haian": 2387, "Yihe": 2388, "Jiangsu,": 2389, "WAG": 2390, "Worldsec": 2391, "40/F": 2392, "Beach": 2393, "17/F.,": 2394, "Intersection": 2395, "FCS)": 2396, "Choong": 2397, "Tau": 2398, "13/F.,": 2399, "Qu": 2400, "6–8": 2401, "Lyu": 2402, "Nice": 2403, "Daniel": 2404, "BBS,": 2405, "Plaza,": 2406, "Longhu": 2407, "Xiaoshan": 2408, "Cho": 2409, "Bai": 2410, "Rui": 2411, "Loeb": 2412, "River": 2413, "Secretaries)": 2414, "47": 2415, "Zhuozhou": 2416, "Changqing": 2417, "HKRI": 2418, "Small": 2419, "102": 2420, "1003,": 2421, "Longdong": 2422, "2681,": 2423, "Fleming": 2424, "Mong": 2425, "10/F.,": 2426, "Nanhu": 2427, "investment": 2428, "Wenyi": 2429, "Sia": 2430, "Waterfront": 2431, "EverGreen": 2432, "GAO": 2433, "Heilongjiang": 2434, "Muk": 2435, "Putra": 2436, "O.": 2437, "(Advising": 2438, "PT": 2439, "Yueqing,": 2440, "Gordon": 2441, "SHARE": 2442, "Apartments": 2443, "Daxing": 2444, "Jong": 2445, "Meng": 2446, "Virgin": 2447, "Cavendish": 2448, "CNI": 2449, "068809": 2450, "Messis": 2451, "Fenwick": 2452, "Waterloo": 2453, "Peninsula": 2454, "Thornton": 2455, "Excellent": 2456, "Success": 2457, "599": 2458, "Morgan,": 2459, "Bockius": 2460, "Ever": 2461, "Greater": 2462, "only": 2463, "advisor": 2464, "30,": 2465, "Nobleseed": 2466, "Forwin": 2467, "120": 2468, "Lixia": 2469, "Shou": 2470, "Sou": 2471, "Yicheng": 2472, "(HKICS,": 2473, "A2": 2474, "Xiacheng": 2475, "Metro": 2476, "Provident": 2477, "Tingting": 2478, "Winsan": 2479, "Rizhao": 2480, "39th": 2481, "1501,": 2482, "Dingxiang": 2483, "See": 2484, "Mau": 2485, "Alan": 2486, "share": 2487, "TD": 2488, "Opus": 2489, "(FCIS,": 2490, "Jiaojiang": 2491, "matters": 2492, "ZMF": 2493, "conversion": 2494, "Pre-IPO": 2495, "advertisements,": 2496, "(which": 2497, "July": 2498, "),": 2499, "\")": 2500, "unconditional;": 2501, "currency,": 2502, "time,": 2503, "Over-Allotment": 2504, "fair": 2505, "based": 2506, "whole;": 2507, "Scheme),": 2508, "Underwriter(s))": 2509, "showing": 2510, "warranties": 2511, "inter-bank": 2512, "similar": 2513, "must": 2514, "''Structure": 2515, "Group;": 2516, "thereof),": 2517, "BOOKRUNNERS": 2518, "re-allocation": 2519, "UNDERWRITER": 2520, "adverse": 2521, "(among": 2522, "things)": 2523, "grant": 2524, "Participant": 2525, "sold": 2526, "withdrawn,": 2527, "Option,": 2528, "fall": 2529, "warranties,": 2530, "agreements": 2531, "notice,": 2532, "discovered": 2533, "condensed": 2534, "Liaoning": 2535, "Indonesia": 2536, "Youyi": 2537, "Hexi": 2538, "HKICPA)": 2539, "Conduit": 2540, "SU": 2541, "Hougang": 2542, "#15-18": 2543, "Minton": 2544, "534083": 2545, "45,": 2546, "Yincheng": 2547, "58": 2548, "Teng": 2549, "Fasa": 2550, "Fairview": 2551, "REN": 2552, "no.": 2553, "Pong": 2554, "(HKICPA,": 2555, "100025": 2556, "attorneys-at-law)": 2557, "Andrew": 2558, "39/F": 2559, "Jinxiu": 2560, "Xuefu": 2561, "Shushan": 2562, "42nd": 2563, "Offices,": 2564, "Jingsong": 2565, "Hongshan": 2566, "Paya": 2567, "6/F.,": 2568, "3303,": 2569, "1601-04,": 2570, "DLA": 2571, "Rongchao": 2572, "Trade": 2573, "MS": 2574, "81100": 2575, "Qiao": 2576, "Rules": 2577, "(US)": 2578, "2102,": 2579, "North,": 2580, "502": 2581, "Christopher": 2582, "Ai": 2583, "Vincent": 2584, "48/F.,": 2585, "Agent": 2586, "BT": 2587, "1001": 2588, "25,": 2589, "Further": 2590, "50–52": 2591, "Tseng": 2592, "149": 2593, "141": 2594, "201": 2595, "Edwin": 2596, "Parc": 2597, "Ngan": 2598, "Victor": 2599, "Jinhua": 2600, "44/F,": 2601, "Allen": 2602, "Grove": 2603, "39,": 2604, "BOA": 2605, "Hongmei": 2606, "200": 2607, "Fangda": 2608, "84": 2609, "Yuelu": 2610, "Palisades": 2611, "Four": 2612, "Joincap": 2613, "Shuyang": 2614, "Boundary": 2615, "Ernest": 2616, "Foshan": 2617, "Salle": 2618, "Dapeng": 2619, "33rd": 2620, "Inc.": 2621, "Stubbs": 2622, "70": 2623, "Marketsense": 2624, "1103,": 2625, "Fen": 2626, "Leung,": 2627, "Wonderland": 2628, "Herbert": 2629, "77,": 2630, "Damansara": 2631, "Nicholas": 2632, "CAO": 2633, "MAK": 2634, "KAB": 2635, "AVISTA": 2636, "Brian": 2637, "Economic-Technological": 2638, "Hwang": 2639, "CHANG": 2640, "Lee,": 2641, "42": 2642, "Ong": 2643, "35,": 2644, "3A": 2645, "C.": 2646, "42/F,": 2647, "Butler": 2648, "Su": 2649, "10F,": 2650, "Get": 2651, "Chao": 2652, "Somerley": 2653, "PAN": 2654, "Chit": 2655, "purposes": 2656, "Hiu": 2657, "Freshfields": 2658, "Bruckhaus": 2659, "Deringer": 2660, "Wenqiao": 2661, "60": 2662, "Rajah": 2663, "Tann": 2664, "65": 2665, "303,": 2666, "Suzhou,": 2667, "Mark": 2668, "Broadview": 2669, "Seaview": 2670, "Mun,": 2671, "Ms": 2672, "Manor": 2673, "III": 2674, "Impian": 2675, "Sanfeng": 2676, "Mizuho": 2677, "RaffAello": 2678, "803,": 2679, "Zhangjiang": 2680, "Chief": 2681, "Biyun": 2682, "Teo": 2683, "Lian": 2684, "YIN": 2685, "Yuyan": 2686, "Chou": 2687, "(an": 2688, "Hibiscus": 2689, "(冼國明)": 2690, "Chung,": 2691, "Harbin": 2692, "XIAO": 2693, "Xie": 2694, "Xiaoming": 2695, "Nankai": 2696, "Robert": 2697, "DAI": 2698, "PA": 2699, "(Kirin)": 2700, "Chungs": 2701, "Henley": 2702, "Reed": 2703, "Meihua": 2704, "Xuyang": 2705, "Introduction.": 2706, "Investors": 2707, "1601–04,": 2708, "Xinyuan": 2709, "Zhengzhou": 2710, "advising": 2711, "Shaoxing": 2712, "Xi'an": 2713, "included": 2714, "Xiangzhou": 2715, "Resort": 2716, "XIE": 2717, "LOU": 2718, "A-C,": 2719, "-------------": 2720, "21,": 2721, "Wendy": 2722, "—": 2723, "Changle": 2724, "Wisma": 2725, "Lama": 2726, "58100": 2727, "Blk": 2728, "Hang,": 2729, "How": 2730, "1504,": 2731, "Thye": 2732, "Rato,": 2733, "Advogados": 2734, "#33-00": 2735, "Zhuang": 2736, "322": 2737, "PLT": 2738, "Darul": 2739, "504,": 2740, "Mountain": 2741, "report": 2742, "Sio": 2743, "Dongguan": 2744, "Hutong": 2745, "(Singapore)": 2746, "Phoenix": 2747, "Longgang": 2748, "Jiao": 2749, "Leo": 2750, "Apt": 2751, "#05-01": 2752, "Sino": 2753, "6-8": 2754, "A–C,": 2755, "Sertus": 2756, "Governors": 2757, "Lime": 2758, "518048": 2759, "49": 2760, "follows)": 2761, "Accountants,": 2762, "Jiangbei": 2763, "4503-07,": 2764, "Pulsar": 2765, "No.10": 2766, "Ru,": 2767, "CLC": 2768, "Mirae": 2769, "Rua": 2770, "Areia": 2771, "Preta": 2772, "could": 2773, "REIT.": 2774, "Chongwen": 2775, "Broadway": 2776, "Alex": 2777, "2704,": 2778, "Foreign": 2779, "100020": 2780, "Danny": 2781, "Farm": 2782, "You": 2783, "6A": 2784, "Keyuan": 2785, "York,": 2786, "Shijingshan": 2787, "BBS": 2788, "general": 2789, "Jefferies": 2790, "results": 2791, "operations": 2792, "37/F": 2793, "Woodlands": 2794, "Mouette": 2795, "JGC": 2796, "Party": 2797, "not,": 2798, "value": 2799, "Shareholders,": 2800, "SECURITIES": 2801, "communications": 2802, "Tuesday,": 2803, "supplemental": 2804, "materials": 2805, "infectious": 2806, "15,000,000": 2807, "Agreements": 2808, "monetary": 2809, "markets)": 2810, "applications": 2811, "fit": 2812, "Documents'')": 2813, "honest": 2814, "assumptions,": 2815, "(other": 2816, "Over-": 2817, "party": 2818, "fiscal": 2819, "regulatory": 2820, "subsidiaries": 2821, "COORDINATORS": 2822, "signed,": 2823, "announcements": 2824, "--": 2825, "are:": 2826, "converted": 2827, "orally": 2828, "\"),": 2829, "expressions": 2830, "clearing": 2831, "Jakarta": 2832, "Villa,": 2833, "72": 2834, "Dongshan": 2835, "CHUNG": 2836, "08,": 2837, "91": 2838, "(FCCA,": 2839, "Sdn.": 2840, "Bhd.": 2841, "138": 2842, "1916,": 2843, "(胡大祥)": 2844, "Associates": 2845, "Irvine": 2846, "57": 2847, "1202,": 2848, "Shekou": 2849, "Cove": 2850, "Pokfulam,": 2851, "Subang": 2852, "Harneys": 2853, "Fiduciary": 2854, "RHTLaw": 2855, "Vietnam": 2856, "(范智超)": 2857, "Johor,": 2858, "94111": 2859, "(陳昌達)": 2860, "(ACIS;": 2861, "Huli": 2862, "Queen": 2863, "(alias:": 2864, "Rong": 2865, "24th": 2866, "Fan,": 2867, "2405,": 2868, "Jianmin": 2869, "Special": 2870, "Transfer": 2871, "ZHAI": 2872, "601": 2873, "1502,": 2874, "Clement": 2875, "Yingze": 2876, "Upper": 2877, "1802,": 2878, "Aimin": 2879, "Ruilin": 2880, "disclosed": 2881, "Nisa": 2882, "Rm": 2883, "Employee": 2884, "Dongli": 2885, "Nanming": 2886, "Alice": 2887, "Bel": 2888, "name": 2889, "Differ": 2890, "H.M.": 2891, "Stephen": 2892, "(梁雪穎)": 2893, "Professional": 2894, "(alias": 2895, "Houshayu": 2896, "Anglo": 2897, "Finance,": 2898, "Holland": 2899, "Close": 2900, "(黃偉德)": 2901, "Prince": 2902, "Beiyuan": 2903, "2402,": 2904, "Greenfield": 2905, "Chia": 2906, "Pingyin": 2907, "Parkside": 2908, "Shaomu": 2909, "6001": 2910, "N.V.": 2911, "15–18": 2912, "Ann": 2913, "(麥寶文)": 2914, "76": 2915, "HUA": 2916, "Guanghua": 2917, "Wings": 2918, "(胡定旭)": 2919, "14/F.,": 2920, "(Mr.": 2921, "Chen)": 2922, "Seah": 2923, "Bernard": 2924, "CHOW": 2925, "Mid": 2926, "14/F.": 2927, "Mingcheng": 2928, "1301,": 2929, "Guohua": 2930, "HGNH": 2931, "Edith": 2932, "5JP": 2933, "Apt.": 2934, "Zhongxinsi": 2935, "Yuguo": 2936, "Pokok": 2937, "Serunai": 2938, "468164": 2939, "Mui": 2940, "Yushan": 2941, "HKICS,": 2942, "Dao": 2943, "S.": 2944, "KY1-1104,": 2945, "Dongfang": 2946, "Huaxia": 2947, "Bei": 2948, "Enlighten": 2949, "Hans": 2950, "1403,": 2951, "Plot": 2952, "Landmark,": 2953, "Cheung,": 2954, "Solicitor,": 2955, "3708,": 2956, "Addleshaw": 2957, "Goddard": 2958, "Timothy": 2959, "Club": 2960, "Verde": 2961, "Sing,": 2962, "SO": 2963, "Communications": 2964, "YUAN": 2965, "Longhua": 2966, "Fuxing": 2967, "Sea": 2968, "Crest": 2969, "Knight": 2970, "Petty": 2971, "401": 2972, "Ah": 2973, "Choo": 2974, "Index": 2975, "Academy": 2976, "Shareholder": 2977, "6003": 2978, "105,": 2979, "US": 2980, "Dormitory": 2981, "1093,": 2982, "o": 2983, "6F,": 2984, "Desa": 2985, "Kiara": 2986, "Kuan": 2987, "Innovation": 2988, "(information": 2989, "McKenzie": 2990, "Bedford": 2991, "Nexxus": 2992, "200120": 2993, "Imperial": 2994, "Vista": 2995, "LIANG": 2996, "Eversheds": 2997, "12/F.,": 2998, "Jieyang,": 2999, "Yuqing": 3000, "SHEN": 3001, "Yuanyang": 3002, "415": 3003, "Officer)": 3004, "Taiwanese": 3005, "Willie": 3006, "704,": 3007, "160": 3008, "IP": 3009, "Canton": 3010, "ranking": 3011, "assigned)": 3012, "106": 3013, "(黃儒傑)": 3014, "authorised": 3015, "independent": 3016, "PJU": 3017, "Petaling": 3018, "(Legal": 3019, "law)": 3020, "WEI": 3021, "Xueyuan": 3022, "Goh": 3023, "Batu": 3024, "Yang,": 3025, "395": 3026, "(余國權)": 3027, "(葉俊安)": 3028, "8888,": 3029, "1902,": 3030, "Him": 3031, "31119": 3032, "KY1-1205": 3033, "Cabot": 3034, "4QA": 3035, "due": 3036, "Qingpu": 3037, "II,": 3038, "Kong.": 3039, "301": 3040, "Anders": 3041, "Zhonghe": 3042, "Cha": 3043, "Hangcheng": 3044, "8-3": 3045, "Miramas": 3046, "3501": 3047, "Promenade": 3048, "Laws": 3049, "34,": 3050, "2/F.,": 3051, "Haiyue": 3052, "Cortés": 3053, "Zhaoshang": 3054, "Taohuayuan": 3055, "Harney": 3056, "Westwood": 3057, "Riegels": 3058, "Yi,": 3059, "Dickson": 3060, "Jubilee": 3061, "Tso": 3062, "Nexus": 3063, "Camana": 3064, "Ehsan": 3065, "Willow": 3066, "31,": 3067, "Western": 3068, "Beili": 3069, "Collyer": 3070, "Gap": 3071, "Thailand": 3072, "President": 3073, "BMI": 3074, "Guoyuan": 3075, "81,": 3076, "Shizhong": 3077, "181–185": 3078, "6F": 3079, "200031": 3080, "(Member": 3081, "Stephens": 3082, "66": 3083, "Huilongguan": 3084, "Chairperson": 3085, "Hongji": 3086, "Xinyi": 3087, "Duddell": 3088, "Bonham": 3089, "CTF": 3090, "LO": 3091, "Eu": 3092, "Los": 3093, "30th": 3094, "Changcheng": 3095, "Dynasty": 3096, "Hongqiang": 3097, "104,": 3098, "Xia": 3099, "Bookrunner)": 3100, "Path,": 3101, "(霍寶兒)": 3102, "Zang": 3103, "LUO": 3104, "(Shanghai)": 3105, "GREEN": 3106, "118": 3107, "London,": 3108, "WEN": 3109, "Shah": 3110, "Alam": 3111, "Star": 3112, "Gan": 3113, "59200": 3114, "404,": 3115, "Wanbailin": 3116, "150": 3117, "Anhai": 3118, "FCCA,": 3119, "branch": 3120, "Tricor": 3121, "049910": 3122, "(劉偉彪)": 3123, "Excellence": 3124, "Chongqing": 3125, "42/F": 3126, "Eddie": 3127, "KY1-1106": 3128, "these": 3129, "your": 3130, "Manhattan": 3131, "Wuhua": 3132, "Deerhill": 3133, "Shimen": 3134, "Haishan": 3135, "Cangzhou,": 3136, "Denmark": 3137, "1002,": 3138, "Tongfang": 3139, "2601,": 3140, "management.": 3141, "Jaffe": 3142, "TC": 3143, "181-185": 3144, "AWSG": 3145, "Pearl": 3146, "Jiangning": 3147, "45th": 3148, "conclusion": 3149, "Company.": 3150, "compliance": 3151, "Kellett": 3152, "Ricky": 3153, "CSC": 3154, "more": 3155, "250": 3156, "government": 3157, "business,": 3158, "Bao'an": 3159, "road": 3160, "Aerospace": 3161, "Bun": 3162, "FOR": 3163, "board": 3164, "legal": 3165, "purchase,": 3166, "delivered": 3167, "purchase": 3168, "Properties": 3169, "located": 3170, "Shekou,": 3171, "Articles": 3172, "one": 3173, "Enhanced": 3174, "imposed": 3175, "parties": 3176, "materials,": 3177, "announcement,": 3178, "substantially": 3179, "circumstances": 3180, "entering": 3181, "riot,": 3182, "Under": 3183, "Exchange;": 3184, "tsunami,": 3185, "terrorism": 3186, "legal,": 3187, "Plans,": 3188, "AGREEMENT": 3189, "cause": 3190, "forecast,": 3191, "commences": 3192, "Exchange:": 3193, "repeated": 3194, "provisions": 3195, "cases,": 3196, "considered,": 3197, "SOLE": 3198, "''Termination": 3199, "market,": 3200, "linked": 3201, "30,000,000": 3202, "duly": 3203, "terms,": 3204, "terrorism)": 3205, "generally": 3206, "swine": 3207, "avian": 3208, "related/mutated": 3209, "jurisdictions": 3210, "incorporated": 3211, "operates": 3212, "upon,": 3213, "meanings": 3214, "amended": 3215, "effective": 3216, "Botny": 3217, "Custodian": 3218, "Thursday,": 3219, "provided": 3220, "incorrect,": 3221, "jurisdiction;": 3222, "Schemes)": 3223, "satisfaction": 3224, "Warranties": 3225, 